Exp_03b_DownstreamScour/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  | Exp-03b                                         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
application     sedFoam_rbgh;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         3600;
deltaT          0.005;
writeControl    adjustableRunTime;
writeInterval   50;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
adjustTimeStep  yes;
maxCo           0.3;
maxAlphaCo      0.3;
maxDeltaT       0.01;
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
