Exp_03b_DownstreamScour/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  | Exp-03b (Soffit at y=0.0387m, Deck extends to Y) |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale 1;

vertices
(
    // Front plane (z = 0)
    (-0.5  -0.12 0.0) // 0
    ( 0.0  -0.12 0.0) // 1
    ( 0.153 -0.12 0.0) // 2
    ( 2.0   -0.12 0.0) // 3

    (-0.5   0.0  0.0) // 4
    ( 0.0   0.0  0.0) // 5
    ( 0.153  0.0  0.0) // 6
    ( 2.0   0.0  0.0) // 7

    (-0.5   0.0387 0.0) // 8  (Soffit elevation = Y - Hb = 0.1107 - 0.072 = 0.0387m)
    ( 0.0   0.0387 0.0) // 9
    ( 0.153  0.0387 0.0) // 10
    ( 2.0   0.0387 0.0) // 11

    (-0.5   0.1107 0.0) // 12 (Flume water top Y = 11.07cm)
    ( 0.0   0.1107 0.0) // 13
    ( 0.153  0.1107 0.0) // 14
    ( 2.0   0.1107 0.0) // 15

    // Back plane (z = 0.01)
    (-0.5  -0.12 0.01) // 16
    ( 0.0  -0.12 0.01) // 17
    ( 0.153 -0.12 0.01) // 18
    ( 2.0   -0.12 0.01) // 19

    (-0.5   0.0  0.01) // 20
    ( 0.0   0.0  0.01) // 21
    ( 0.153  0.0  0.01) // 22
    ( 2.0   0.0  0.01) // 23

    (-0.5   0.0387 0.01) // 24
    ( 0.0   0.0387 0.01) // 25
    ( 0.153  0.0387 0.01) // 26
    ( 2.0   0.0387 0.01) // 27

    (-0.5   0.1107 0.01) // 28
    ( 0.0   0.1107 0.01) // 29
    ( 0.153  0.1107 0.01) // 30
    ( 2.0   0.1107 0.01) // 31
);

blocks
(
    // Bed Blocks (y: -0.12 to 0.0 m)
    hex (0 1 5 4 16 17 21 20)       (50  40 1) simpleGrading (1 0.25 1)
    hex (1 2 6 5 17 18 22 21)       (50  40 1) simpleGrading (1 0.25 1)
    hex (2 3 7 6 18 19 23 22)       (150 40 1) simpleGrading (1 0.25 1)

    // Lower Fluid Blocks (y: 0.0 to soffit = 0.0387 m)
    hex (4 5 9 8 20 21 25 24)       (50  45 1) simpleGrading (1 4.0 1)
    hex (5 6 10 9 21 22 26 25)      (50  45 1) simpleGrading (1 4.0 1)
    hex (6 7 11 10 22 23 27 26)     (150 45 1) simpleGrading (1 4.0 1)

    // Upper Fluid Blocks (y: soffit 0.0387 to water top 0.1107) - Omit central block above soffit
    hex (8 9 13 12 24 25 29 28)     (50  35 1) simpleGrading (1 1.0 1)
    hex (10 11 15 14 26 27 31 30)   (150 35 1) simpleGrading (1 1.0 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 20 16)
            (4 8 24 20)
            (8 12 28 24)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 19 23 7)
            (7 23 27 11)
            (11 27 31 15)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 16 17 1)
            (1 17 18 2)
            (2 18 19 3)
        );
    }
    top
    {
        type wall;
        faces
        (
            (12 13 29 28)
            (14 15 31 30)
        );
    }
    bridgeDeck
    {
        type wall;
        faces
        (
            (9 25 29 13) // Upstream vertical wall
            (9 10 26 25) // Deck bottom (soffit)
            (10 14 30 26) // Downstream vertical wall
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (4 5 9 8)
            (5 6 10 9)
            (6 7 11 10)
            (8 9 13 12)
            (10 11 15 14)

            (16 20 21 17)
            (17 21 22 18)
            (18 22 23 19)
            (20 24 25 21)
            (21 25 26 22)
            (22 26 27 23)
            (24 28 29 25)
            (26 30 31 27)
        );
    }
);
