Exp_03b_DownstreamScour/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
phasea
{
    rho             rho [ 1 -3 0 0 0 ] 2650;
    nu              nu [ 0 2 -1 0 0 ] 1e-6;
    d               d [ 0 1 0 0 0 0 0 ] 0.000212; // Ahmedabad sand d50
    sF              sF   [ 0 0  0 0 0 0 0 ] 1.;
    hExp            hExp [ 0 0  0 0 0 0 0 ] 2.65;
}

phaseb
{
    rho             rho [ 1 -3 0 0 0 ] 1000;
    nu              nu [ 0 2 -1 0 0 ] 1e-6;
    d               d [ 0 1 0 0 0 0 0 ] 10e-6;
    sF              sF   [ 0 0  0 0 0 0 0 ] 1.;
    hExp            hExp [ 0 0  0 0 0 0 0 ] 2.65;
}

alphaSmall      alphaSmall [ 0 0 0 0 0 0 0 ] 1e-4;
alphaAlpha      alphaAlpha [ 0 0 0 0 0 ] 0;
Cvm             Cvm [ 0 0 0 0 0 ] 0;
Cl              Cl [ 0 0 0 0 0 ] 0;

transportModel  Newtonian;
nu              nu [ 0 2 -1 0 0 0 0 ] 1e-6;
nuMax           nuMax [0 2 -1 0 0 0 0] 10;
alphaMax        alphaMax [ 0 0 0 0 0 0 0 ] 0.60;
